ruby_on_rails/project_management_demo/app/views/project/edit.html.erb

SELECT `teamleads`.* FROM `teamleads`
---
  <div class="form-group">
      <p><label for = "project_teamlead_id">LeamLead</label>: <%= f.collection_select :teamlead_id, Teamlead.all, :id, :name %></p>