ruby_on_rails/project_management_demo/app/views/project/show_teamleads.html.erb

<ul>
    <% @teamlead.projects.each do |c| %>
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`teamlead_id` = 1