ruby_on_rails/project_management_demo/app/controllers/project_controller.rb

  def list
      @projects = Project.all
---
SELECT `projects`.* FROM `projects`

   def show
      @project = Project.find(params[:id])
      @project.update_column('count_view', @project.count_view + 1) if @project.present?
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
UPDATE `projects` SET `count_view` = 2 WHERE `projects`.`id` = 1

   def new
      @project = Project.new
      @teamleads = Teamlead.all
---
SELECT `teamleads`.* FROM `teamleads`

   def create
      @project = Project.new(project_params)

      if @project.save
---
INSERT INTO `projects` (`title`, `teamlead_id`, `description`, `created_at`) VALUES ('javaapp', 3, 'for finance', '2018-08-30 18:24:59')

   def edit
      @project = Project.find(params[:id])
      @teamleads = Teamlead.all
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `teamleads`.* FROM `teamleads`

   def update
      @project = Project.find(params[:id])

      if @project.update_attributes(project_param)
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
UPDATE `projects` SET `description` = 'basic create simple rails webapp for POC.' WHERE `projects`.`id` = 1

   def delete
      Project.find(params[:id]).destroy
---
DELETE FROM `projects` WHERE `projects`.`id` = 2
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 2 LIMIT 1

   def show_teamleads
      @teamlead = Teamlead.find(params[:id])
---
SELECT  `teamleads`.* FROM `teamleads` WHERE `teamleads`.`id` = 1 LIMIT 1